
  #### Terraform Plan (dev) 📖`success`

  <details><summary>Show Plan</summary>

  ```terraform
data.google_iam_workload_identity_pool.github-id-pool: Reading...
data.google_iam_workload_identity_pool.github-id-pool: Read complete after 0s [id=projects/tasuke-dev/locations/global/workloadIdentityPools/github]
data.google_kms_secret.identity_github-client-secret_EDD212F4: Reading...
data.google_kms_secret.identity_github-client-secret_EDD212F4: Read complete after 0s [id=tasuke-dev/global/terraform/secrets:CiQAXEJPaOVToTI/ZP1UgABZxb46MbFaGbG9rudZQIYCj2dODLESUQC761MooR3tZ+oT2IYATtegCK1EEg2SRtTfJY1P6XjE/X/ZHlXJjT35/JcdJm7y23ro9jUCwAj941R1RDsXjxZNRrDBXaEhcgDYjR1MPcbV2w==]
data.google_kms_secret.secrets_github-app-private-key-base64-decrypted_2C1423BC: Reading...
data.google_kms_secret.secrets_github-app-private-key-base64-decrypted_2C1423BC: Read complete after 0s [id=tasuke-dev/global/terraform/secrets:CiQAXEJPaN2qw5GTFTE9bHlfTC6JBX/fNlYm0X0EEoBFI9HSw9AS6xEAu+tTKNyv6UplExBbCyn3yBYaXL7rBFbOD1qYYTr8FSZ/f3ioQeUElvCI97981BzE7N/z74mdsVoRxZ51SiuJYrjvLK6pFqD5+WeWNncTKkEgGsQjLtwtJPWlC89gYnhFGsvNmwTtJ/DiLkKRe9XMyKOZy3hGyflKsqTr3kb6c2m7oe2x45NGdBVrd4970UT8+y6qjXzEpgAtD/O1JdvuvuAwjNLsRMrCdwX/d2cpKidIOKGZASrUOAZTzFfpfsF5ZSp2zMqBPCJjzFKKOGpLBYd3oqKjYH26ZnQumkAR3XkTbZnb80bZ+17tdJ2VMwcCIW5KDlTeqDK68MmNlaRFtbC4VcOndx6Jn3KKOQhOxRvhasDHLX2DET0rgIpwYbyfniZSAIZue3y8ZjKFPZwHWaS/qg04yRzCFApLNuXA6s994lYXN0HZlh6AOfhDClYk0So2rxg06HPjVVSqrHPSjlyEUiNQz3RdliG22S0YUHS3kMHFgoZm+4iLPOJKnfN6aEvXHWZ45lXZnOKjV1+72U9fAEFOz2u5arqXAAjBl+hNW8FlhA45AVlPjmFw9JYSDbwQ1sCq6AOJfOWRzw+pz8NbBDkmMLb0w3Rfx+5+NQArBfm693Pwa+64Dau2Mmlir1zHis8dJ+RW+mPXExjVs2CciHyV5DXj7rNbFe/5j/OdIqnAd+UlFHdnyVMMeaEuCE7nz+ibnVoRa6p50llX5IO3/z9zsuTd6Lhc4uw9HbgtrZIpVuydVzTimDMRHLW9V4bGdRhBxRTc24wi3LKcfJOyEjrYvZ8S2iutsbkuubHjsp9NoevP4vfEmgzOwGiFlvmE6LHL9eYtovmHXdLGvjW0wjvn4TYlgwtm7Ug3nJtJlXbkGgZ3a9SEp4Re6miqjIHA2EVA3dYEfSerh8XA00IwkAONKHNBOOT9k2t2IoQaJKQy6X3gEQjVKaYE/xmAZ5VduMvWD43NW32hwIli7g+KBxmIwv+YLlmoiOv2jWkHscDyWwkvDoF/Mp04QCYtIpmi5z0HvNCCxmW9S8gblsKA2Lh1ccsPEye60gnAQHfHP31F3MlEEAoYlAtlJaeYwoUM8jezb2P6paMKzRBrMz+IUyTlY4s2M12MXWTtOCg2RFbMTzxhWHn5mLOFxRWw0WLpVG6L4DESXF+xB9A+t9zX/9PjNeKXb5TtzqaKCcqoLYuwlyKQUnpgv/9AHtBX61IYsTvjqsbjwStumM9q2RqyxYnJkstRBH51yOq4iSqUYh2ECUvE6jaIPTBzc0Z1QegnUyIeAHx+j630eBKDVtqtlrb6OGmgtKbRcqWONCAx/GkjA5CC7LqmD0U6zRtEnc4XVaOOSsTldrGFULvhu78SzWmBZsJdy30kCUOq0Vz89dsJLqmK+xZ54gWwz6f7dgAwftLNd0OsmiiWqXDjpiyR+Fy1D6JNSt9iqarSTNcAEDmgPTygjB/xtPKcOh+GNCYN9qWJq0f5XcgrhjV2cDf+FKEZYgM1LNrF4GPJNyLirqPKWJ58sm7Ja/gwjRwkX3nMfmpGFNmqqft3zBwNMy+5Bw33n+FGjeEo6sgHylmhdOPjyOJhYph+NJPRphDcrCrsHJO+9k+refaE8+p6znxTPc4qqXu15jK8Sc53/43hHkmy6FcIrYWvBUJISlAz+byZfgICwWvzjU2x0kC3EFvWPCi+o4VzITx134bWIX11sg9Qr2xjZO/nmvNaDMC+p77CNUZrQdS/Tm7eLJo5zlHQFUU4b9pvy+q7UXakgfitRFBN1jMeIsAUr3j6azvLzSomHEP65yZLOaXLrRhc7GB15J8cNcNaibsj4Yal+ONKQJB5lB5CwS1+5Ld5htruoGwW5OIRiVZlhhto044seyWPQ8599UHop/GP1ZBfLFdiHdUtp6foNsQHMJ4ZzngqwvImwknNSycWLUC5xYXje4zGhYKvegxUQrYlNoP2phyopWAqoPQqEefJm2zzUHl21ID2Vw2tqyLaRI79B5rqMTrTpcHGOKEuXX/Ud1zW135/qHqEw2LK4YfT6yo1YXo5xXXigN60pYWXNGGdHm50L2tVST82KqwWO1Yuq/igiX1qXNajlCglFavi0xK5KRpfhx5Sm5CUpTM5mVoIGGhV8TEkSKPp3lbyum/7Nzh83D6e/AFSIJUhk1GHFeUXnNUgoW1m1XYU3yXsc5i/gEkW65ZJ9K709IFAnftVLugMRRS5LCiupl/dIgcpnSfidxWbNvrDjm4+Rr1SiBgFO3YyabfQrY4W0DCN8+h39YTHKjg+Q4FkNTsdxs2YeYySeSRduw1z8z37nCS4HfWC2sFydM276n/i2IFGciqzSpZtDGEaASlT9V6n79qWZk3xmvLqaFeQkCr2DzFqedf23TB13CcZza45ylUWgLKM8dw0aRDYbEpJnerO+93b8khRAupEvz3i4lS+waqqwp2dxhLzSya9F0xlgA3UGUKv323BFubYWQNSjn/F94FGJXbnbI9i3/KSVV7tpM5oDxvMLj1O50pGMgL3TDScq3voC2tE/O7VZTil+323Si1Bp8gC4JuY6Bc7/TqlHPjBKf2qwDezIV+RQsROnjwCEWssWqxFw6foHV9NRAAPrEYzFSh0+kTd8fRKSwgpC1J9gzC7JfVdzWvP9A5l6UCuduJS2Y38H5GAgwQs647TwxKs5H2kgxn76NwbEU4CaPnJxEOMfDOHAaz8ndoLzyArd3YdEhs1lkn/UAOBEplNftv+6ks/0M477goes9jzfQLwBXm7cYJT66wtPow3DQ15AP6aXRd5NrZ6ZqyclYiemi7Ka952FmK8Ntd3Nky7QwSdj6JON7B7xkqC4cEQbtGhMLaP3p6D8u3b7vTdtzhJVbthreuBKBGVQwtYY/0lbKFe2bp2HX/dSiWVjBqwciELDEtHVH5Hujiwl+4AMyDpmVOWLiq/3t5rsZnPvlounrdvRqkSQIMmSgPYN/bE9Os6WVKyYbNsC64pB+JarnN//nWrp5ic+0dTtntMa51Pyy4YPyQH4JEo3LJJauFMQTO5lSw=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account.service-accounts_choko-test_5D28252F will be created
  + resource "google_service_account" "service-accounts_choko-test_5D28252F" {
      + account_id = "choko-test"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "tasuke-dev"
      + unique_id  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>
